summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.FBE */
#define IFX_ETH_INTERRUPT_ENABLE_FBE_OFF (13)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.NIE */
#define IFX_ETH_INTERRUPT_ENABLE_NIE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.NIE */
#define IFX_ETH_INTERRUPT_ENABLE_NIE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.NIE */
#define IFX_ETH_INTERRUPT_ENABLE_NIE_OFF (16)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.OVE */
#define IFX_ETH_INTERRUPT_ENABLE_OVE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.OVE */
#define IFX_ETH_INTERRUPT_ENABLE_OVE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.OVE */
#define IFX_ETH_INTERRUPT_ENABLE_OVE_OFF (4)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.RIE */
#define IFX_ETH_INTERRUPT_ENABLE_RIE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.RIE */
#define IFX_ETH_INTERRUPT_ENABLE_RIE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.RIE */
#define IFX_ETH_INTERRUPT_ENABLE_RIE_OFF (6)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.RSE */
#define IFX_ETH_INTERRUPT_ENABLE_RSE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.RSE */
#define IFX_ETH_INTERRUPT_ENABLE_RSE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.RSE */
#define IFX_ETH_INTERRUPT_ENABLE_RSE_OFF (8)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.RUE */
#define IFX_ETH_INTERRUPT_ENABLE_RUE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.RUE */
#define IFX_ETH_INTERRUPT_ENABLE_RUE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.RUE */
#define IFX_ETH_INTERRUPT_ENABLE_RUE_OFF (7)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.RWE */
#define IFX_ETH_INTERRUPT_ENABLE_RWE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.RWE */
#define IFX_ETH_INTERRUPT_ENABLE_RWE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.RWE */
#define IFX_ETH_INTERRUPT_ENABLE_RWE_OFF (9)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.TIE */
#define IFX_ETH_INTERRUPT_ENABLE_TIE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.TIE */
#define IFX_ETH_INTERRUPT_ENABLE_TIE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.TIE */
#define IFX_ETH_INTERRUPT_ENABLE_TIE_OFF (0)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.TJE */
#define IFX_ETH_INTERRUPT_ENABLE_TJE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.TJE */
#define IFX_ETH_INTERRUPT_ENABLE_TJE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.TJE */
#define IFX_ETH_INTERRUPT_ENABLE_TJE_OFF (3)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.TSE */
#define IFX_ETH_INTERRUPT_ENABLE_TSE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.TSE */
#define IFX_ETH_INTERRUPT_ENABLE_TSE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.TSE */
#define IFX_ETH_INTERRUPT_ENABLE_TSE_OFF (1)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.TUE */
#define IFX_ETH_INTERRUPT_ENABLE_TUE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.TUE */
#define IFX_ETH_INTERRUPT_ENABLE_TUE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.TUE */
#define IFX_ETH_INTERRUPT_ENABLE_TUE_OFF (2)

/** \\brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.UNE */
#define IFX_ETH_INTERRUPT_ENABLE_UNE_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_ENABLE_Bits.UNE */
#define IFX_ETH_INTERRUPT_ENABLE_UNE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_ENABLE_Bits.UNE */
#define IFX_ETH_INTERRUPT_ENABLE_UNE_OFF (5)

/** \\brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.LPIIM */
#define IFX_ETH_INTERRUPT_MASK_LPIIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.LPIIM */
#define IFX_ETH_INTERRUPT_MASK_LPIIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.LPIIM */
#define IFX_ETH_INTERRUPT_MASK_LPIIM_OFF (10)

/** \\brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.PCSANCIM */
#define IFX_ETH_INTERRUPT_MASK_PCSANCIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.PCSANCIM */
#define IFX_ETH_INTERRUPT_MASK_PCSANCIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.PCSANCIM */
#define IFX_ETH_INTERRUPT_MASK_PCSANCIM_OFF (2)

/** \\brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.PCSLCHGIM */
#define IFX_ETH_INTERRUPT_MASK_PCSLCHGIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.PCSLCHGIM */
#define IFX_ETH_INTERRUPT_MASK_PCSLCHGIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.PCSLCHGIM */
#define IFX_ETH_INTERRUPT_MASK_PCSLCHGIM_OFF (1)

/** \\brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.PMTIM */
#define IFX_ETH_INTERRUPT_MASK_PMTIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.PMTIM */
#define IFX_ETH_INTERRUPT_MASK_PMTIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.PMTIM */
#define IFX_ETH_INTERRUPT_MASK_PMTIM_OFF (3)

/** \\brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.RGSMIIIM */
#define IFX_ETH_INTERRUPT_MASK_RGSMIIIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.RGSMIIIM */
#define IFX_ETH_INTERRUPT_MASK_RGSMIIIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.RGSMIIIM */
#define IFX_ETH_INTERRUPT_MASK_RGSMIIIM_OFF (0)

/** \\brief  Length for Ifx_ETH_INTERRUPT_MASK_Bits.TSIM */
#define IFX_ETH_INTERRUPT_MASK_TSIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_MASK_Bits.TSIM */
#define IFX_ETH_INTERRUPT_MASK_TSIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_MASK_Bits.TSIM */
#define IFX_ETH_INTERRUPT_MASK_TSIM_OFF (9)

/** \\brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_OFF (10)

/** \\brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_MSK (0x1)

