summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_RX_PAUSE_FRAMES_Bits.RXPAUSEFRM */
#define IFX_ETH_RX_PAUSE_FRAMES_RXPAUSEFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_PAUSE_FRAMES_Bits.RXPAUSEFRM */
#define IFX_ETH_RX_PAUSE_FRAMES_RXPAUSEFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits.RXRCVERR */
#define IFX_ETH_RX_RECEIVE_ERROR_FRAMES_RXRCVERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits.RXRCVERR */
#define IFX_ETH_RX_RECEIVE_ERROR_FRAMES_RXRCVERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits.RXRCVERR */
#define IFX_ETH_RX_RECEIVE_ERROR_FRAMES_RXRCVERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits.RXRUNTERR */
#define IFX_ETH_RX_RUNT_ERROR_FRAMES_RXRUNTERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits.RXRUNTERR */
#define IFX_ETH_RX_RUNT_ERROR_FRAMES_RXRUNTERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits.RXRUNTERR */
#define IFX_ETH_RX_RUNT_ERROR_FRAMES_RXRUNTERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits.RXUNDERSZG */
#define IFX_ETH_RX_UNDERSIZE_FRAMES_GOOD_RXUNDERSZG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits.RXUNDERSZG */
#define IFX_ETH_RX_UNDERSIZE_FRAMES_GOOD_RXUNDERSZG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits.RXUNDERSZG */
#define IFX_ETH_RX_UNDERSIZE_FRAMES_GOOD_RXUNDERSZG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits.RXUCASTG */
#define IFX_ETH_RX_UNICAST_FRAMES_GOOD_RXUCASTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits.RXUCASTG */
#define IFX_ETH_RX_UNICAST_FRAMES_GOOD_RXUCASTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits.RXUCASTG */
#define IFX_ETH_RX_UNICAST_FRAMES_GOOD_RXUCASTG_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits.RXVLANFRGB */
#define IFX_ETH_RX_VLAN_FRAMES_GOOD_BAD_RXVLANFRGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits.RXVLANFRGB */
#define IFX_ETH_RX_VLAN_FRAMES_GOOD_BAD_RXVLANFRGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits.RXVLANFRGB */
#define IFX_ETH_RX_VLAN_FRAMES_GOOD_BAD_RXVLANFRGB_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits.RXWDGERR */
#define IFX_ETH_RX_WATCHDOG_ERROR_FRAMES_RXWDGERR_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits.RXWDGERR */
#define IFX_ETH_RX_WATCHDOG_ERROR_FRAMES_RXWDGERR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits.RXWDGERR */
#define IFX_ETH_RX_WATCHDOG_ERROR_FRAMES_RXWDGERR_OFF (0)

/** \\brief  Length for Ifx_ETH_RXICMP_ERROR_FRAMES_Bits.RXICMPERRFRM */
#define IFX_ETH_RXICMP_ERROR_FRAMES_RXICMPERRFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXICMP_ERROR_FRAMES_Bits.RXICMPERRFRM */
#define IFX_ETH_RXICMP_ERROR_FRAMES_RXICMPERRFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXICMP_ERROR_FRAMES_Bits.RXICMPERRFRM */
#define IFX_ETH_RXICMP_ERROR_FRAMES_RXICMPERRFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_ETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_ETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_ETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_OFF (0)

